{"pageProps":{"jobList":[{"position":"Software Engineer","company":"Brigham Young University - Idaho","location":"Remote","startDate":"2019-9-1","endDate":null,"current":true,"logoUrl":"","descriptions":["Maintained ownership of multiple integration pipelines and full-stack applications that provided services to staff and students all around the world.","Added a versioning system to our survey taking app by restructuring the SQL database.","Set up monitoring for my applications to ensure that any bugs or outages were handled properly.","Improved applications by reducing load times through cutting down redundant API calls and deferring large asset loading until it’s needed.","Found security flaws like broken access control and implemented Azure Pipelines for the projects I was assigned to, in order to check for vulnerable dependencies and improve the deployment process.","Technologies used: .NET core/.NET Framework (C#), SQL Server, Angular, Node.js"]},{"position":"Web Developer Intern","company":"FamilySearch.org","location":"Lehi, UT","startDate":"2019-4-1","endDate":"2019-10-1","current":false,"logoUrl":"","descriptions":["Worked on a campaign to encourage more people to join FamilySearch.org by providing a page where unregistered users can get a sample of the information they can find based on their last name.","Ensured that third-party data integrated properly with the campaign page such as mitigating possible XSS vulnerabilities, increasing code testing coverage, and fixing potential bugs.","Technologies used: React.js, Node.js, EJS, Agile"]},{"position":"Student Software Engineer","company":"Brigham Young University - Idaho","location":"Rexburg, ID","startDate":"2018-7-1","endDate":"2019-4-1","current":false,"logoUrl":"","descriptions":["Worked with a mentor to ensure that our services worked smoothly during high traffic periods such as the beginning of the semester and at the end. Some of these applications were student course registration and instructor submission of final grades.","Technologies used: .NET core, ASP.NET core, SQL server, C#."]}]},"__N_SSG":true}