{"pageProps":{"projectList":[{"title":"Conjecture Test","description":"This is a modified version of a math assignment to test the following conjecture for as many numbers as possible within 24-hours.\n\"that the number of 2's in the prime factorization of nCr(2n,n) for positive integer n is equal to the number of 1's in the binary expansion of n\"\nThe initial assignment ran a Python script that tested every number sequentially. The current version is a rust program where the main thread passes a closure with an arbitrary range of numbers. The closure is passed to a thread pool that calls it. The main thread can queue up to three batches of numbers until it blocks waiting for the channel to have an empty spot for the next batch, this prevents the main thread from filling up the memory with batches that might not get executed. It also gives the chance for another thread to execute while it is blocking.","technologies":["Rust","Multithreading"],"github":"https://github.com/durid-ah/conjecture_test"},{"title":"REST API From Scratch","description":"To better understand how REST servers and HTTP connections work, I decided to build one from scratch starting with a TCP connection that is handed over to a connection manager that spawns goroutines for different to parse the http request and route it to the right endpoints.\n\nThe overall functionality of the server is to store and retrieve contact information in a SQLite database through two endpoints, a GET endpoint to retrieve all and a POST to save a new contact.","technologies":["Go","REST","SQLite","Concurrency"],"github":"https://github.com/durid-ah/go_rest_web_server"},{"title":"Godel Hash Set","description":"An implementation of a hash set using the godel hash for educational purposes","technologies":["Python"],"github":"https://github.com/durid-ah/godel_hash_set"},{"title":"Sentiment Analyzer","description":"It's a website where I can display my projects and work experience. I built it using Next.js and TypeScript, then deployed it to Github pages using Next.js' static site generation feature and Github Actions. After every PR or a push to the main branch, a Github Action executes the static generation command and pushes the new files to a separate branch. This branch is configured as the Github pages branch.","technologies":["Python","Django","Django REST","NLP","Github Actions","Azure","Serverless","SQL Server"],"github":null}],"portfolioDescription":{"title":"Personal Portfolio","description":"It's a website where I can display my projects and work experience. I built it using Next.js and TypeScript, then deployed it to Github pages using Next.js' static site generation feature and Github Actions. After every PR or a push to the main branch, a Github Action executes the static generation command and pushes the new files to a separate branch. This branch is configured as the Github pages branch.","technologies":["Next.js","Node.js","Github Actions","TypeScript"],"github":"https://github.com/durid-ah/durid-ah.github.io"}},"__N_SSG":true}